fio/test_suite_sd_old/bs128k_read100.txt
bs128k_read100: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs128k_read100: Laying out IO file (1 file / 100MiB)
bs128k_read100: Laying out IO file (1 file / 100MiB)
bs128k_read100: Laying out IO file (1 file / 100MiB)
[...]

bs128k_read100: (groupid=0, jobs=4): err= 0: pid=2939: Sun Jun  8 20:20:04 2025
  read: IOPS=174, BW=21.8MiB/s (22.9MB/s)(656MiB/30074msec)
    clat (usec): min=80, max=114625, avg=22843.97, stdev=39042.91
     lat (usec): min=80, max=114625, avg=22845.21, stdev=39042.52
    clat percentiles (usec):
     |  1.00th=[    86],  5.00th=[    93], 10.00th=[   104], 20.00th=[   139],
     | 30.00th=[   149], 40.00th=[   159], 50.00th=[   297], 60.00th=[   515],
     | 70.00th=[   562], 80.00th=[ 90702], 90.00th=[ 90702], 95.00th=[ 90702],
     | 99.00th=[ 90702], 99.50th=[ 93848], 99.90th=[ 98042], 99.95th=[ 98042],
     | 99.99th=[114820]
   bw (  KiB/s): min=19423, max=24576, per=100.00%, avg=22382.79, stdev=514.65, samples=237
   iops        : min=  149, max=  192, avg=173.01, stdev= 4.04, samples=237
  lat (usec)   : 100=7.61%, 250=41.54%, 500=9.00%, 750=15.76%, 1000=0.40%
  lat (msec)   : 2=0.48%, 20=0.10%, 50=0.15%, 100=24.95%, 250=0.02%
  cpu          : usr=0.09%, sys=1.58%, ctx=1370, majf=0, minf=227
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5246,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=21.8MiB/s (22.9MB/s), 21.8MiB/s-21.8MiB/s (22.9MB/s-22.9MB/s), io=656MiB (688MB), run=30074-30074msec

Disk stats (read/write):
  mmcblk0: ios=1315/2, merge=1302/1, ticks=118355/574, in_queue=118929, util=96.40%