fio/test_suite_sd_old/bs16k_write100.txt
bs16k_write100: (g=0): rw=write, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs16k_write100: Laying out IO file (1 file / 100MiB)
bs16k_write100: Laying out IO file (1 file / 100MiB)
bs16k_write100: Laying out IO file (1 file / 100MiB)
[...]

bs16k_write100: (groupid=0, jobs=4): err= 0: pid=2771: Sun Jun  8 20:01:09 2025
  write: IOPS=473, BW=7583KiB/s (7765kB/s)(223MiB/30131msec); 0 zone resets
    clat (usec): min=29, max=4358.0k, avg=8431.35, stdev=116870.57
     lat (usec): min=30, max=4358.0k, avg=8432.89, stdev=116870.75
    clat percentiles (usec):
     |  1.00th=[     39],  5.00th=[     43], 10.00th=[     45],
     | 20.00th=[     49], 30.00th=[     52], 40.00th=[     58],
     | 50.00th=[     62], 60.00th=[     67], 70.00th=[     72],
     | 80.00th=[     81], 90.00th=[    103], 95.00th=[    151],
     | 99.00th=[ 202376], 99.50th=[ 202376], 99.90th=[1216349],
     | 99.95th=[3841983], 99.99th=[4328522]
   bw (  KiB/s): min=  124, max=232160, per=100.00%, avg=11132.85, stdev=8964.38, samples=164
   iops        : min=    4, max=14510, avg=693.37, stdev=560.38, samples=164
  lat (usec)   : 50=25.16%, 100=63.98%, 250=7.77%, 500=0.37%, 750=0.08%
  lat (usec)   : 1000=0.11%
  lat (msec)   : 2=0.01%, 10=0.02%, 250=2.38%, 2000=0.03%, >=2000=0.08%
  cpu          : usr=0.12%, sys=0.82%, ctx=410, majf=0, minf=109
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,14280,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=7583KiB/s (7765kB/s), 7583KiB/s-7583KiB/s (7765kB/s-7765kB/s), io=223MiB (234MB), run=30131-30131msec

Disk stats (read/write):
  mmcblk0: ios=0/236, merge=0/46, ticks=0/593615, in_queue=593616, util=90.88%