fio/test_suite_sd_old/bs32k_write100.txt
bs32k_write100: (g=0): rw=write, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs32k_write100: Laying out IO file (1 file / 100MiB)
bs32k_write100: Laying out IO file (1 file / 100MiB)
bs32k_write100: Laying out IO file (1 file / 100MiB)
[...]

bs32k_write100: (groupid=0, jobs=4): err= 0: pid=2844: Sun Jun  8 20:09:43 2025
  write: IOPS=238, BW=7638KiB/s (7822kB/s)(224MiB/30071msec); 0 zone resets
    clat (usec): min=49, max=12592k, avg=16744.09, stdev=300183.66
     lat (usec): min=51, max=12592k, avg=16747.31, stdev=300183.77
    clat percentiles (usec):
     |  1.00th=[      58],  5.00th=[      72], 10.00th=[      83],
     | 20.00th=[      92], 30.00th=[      97], 40.00th=[     103],
     | 50.00th=[     109], 60.00th=[     117], 70.00th=[     127],
     | 80.00th=[     145], 90.00th=[     194], 95.00th=[     611],
     | 99.00th=[  204473], 99.50th=[  204473], 99.90th=[  868221],
     | 99.95th=[12415140], 99.99th=[12549358]
   bw (  KiB/s): min=  317, max=229376, per=100.00%, avg=13214.31, stdev=9921.69, samples=139
   iops        : min=    7, max= 7168, avg=412.60, stdev=310.05, samples=139
  lat (usec)   : 50=0.01%, 100=35.59%, 250=57.55%, 500=1.69%, 750=0.31%
  lat (usec)   : 1000=0.15%
  lat (msec)   : 2=0.11%, 4=0.07%, 10=0.06%, 20=0.01%, 250=4.22%
  lat (msec)   : 500=0.06%, 750=0.06%, 1000=0.06%, >=2000=0.06%
  cpu          : usr=0.06%, sys=0.74%, ctx=407, majf=0, minf=111
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,7178,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=7638KiB/s (7822kB/s), 7638KiB/s-7638KiB/s (7822kB/s-7822kB/s), io=224MiB (235MB), run=30071-30071msec

Disk stats (read/write):
  mmcblk0: ios=0/238, merge=0/44, ticks=0/1561153, in_queue=1561153, util=94.58%