fio/test_suite_sd_old/bs4k_read20write80.txt
bs4k_read20write80: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs4k_read20write80: Laying out IO file (1 file / 100MiB)
bs4k_read20write80: Laying out IO file (1 file / 100MiB)
bs4k_read20write80: Laying out IO file (1 file / 100MiB)
[...]

bs4k_read20write80: (groupid=0, jobs=4): err= 0: pid=2617: Sun Jun  8 19:44:10 2025
  read: IOPS=150, BW=603KiB/s (618kB/s)(19.7MiB/33427msec)
    clat (usec): min=1179, max=2920.8k, avg=15560.08, stdev=114161.54
     lat (usec): min=1179, max=2920.8k, avg=15560.58, stdev=114161.60
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    4], 95.00th=[   64],
     | 99.00th=[  155], 99.50th=[  247], 99.90th=[ 1452], 99.95th=[ 2937],
     | 99.99th=[ 2937]
   bw (  KiB/s): min=   28, max= 5184, per=100.00%, avg=1377.24, stdev=535.53, samples=117
   iops        : min=    4, max= 1296, avg=342.54, stdev=134.13, samples=117
  write: IOPS=614, BW=2458KiB/s (2517kB/s)(80.3MiB/33427msec); 0 zone resets
    clat (usec): min=9, max=5443.6k, avg=2680.49, stdev=112264.49
     lat (usec): min=10, max=5443.6k, avg=2681.08, stdev=112264.54
    clat percentiles (usec):
     |  1.00th=[     11],  5.00th=[     11], 10.00th=[     11],
     | 20.00th=[     11], 30.00th=[     12], 40.00th=[     12],
     | 50.00th=[     12], 60.00th=[     13], 70.00th=[     17],
     | 80.00th=[     26], 90.00th=[     33], 95.00th=[     39],
     | 99.00th=[     70], 99.50th=[    106], 99.90th=[    498],
     | 99.95th=[2969568], 99.99th=[5469373]
   bw (  KiB/s): min=   36, max=23272, per=100.00%, avg=5973.67, stdev=2242.77, samples=110
   iops        : min=    6, max= 5818, avg=1491.57, stdev=560.98, samples=110
  lat (usec)   : 10=0.05%, 20=58.73%, 50=19.51%, 100=1.54%, 250=0.36%
  lat (usec)   : 500=0.03%, 750=0.02%
  lat (msec)   : 2=0.01%, 4=18.54%, 10=0.02%, 20=0.01%, 50=0.05%
  lat (msec)   : 100=0.38%, 250=0.64%, 500=0.02%, 2000=0.06%, >=2000=0.06%
  cpu          : usr=0.15%, sys=0.46%, ctx=5467, majf=0, minf=117
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5043,20545,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=603KiB/s (618kB/s), 603KiB/s-603KiB/s (618kB/s-618kB/s), io=19.7MiB (20.7MB), run=33427-33427msec
  WRITE: bw=2458KiB/s (2517kB/s), 2458KiB/s-2458KiB/s (2517kB/s-2517kB/s), io=80.3MiB (84.2MB), run=33427-33427msec

Disk stats (read/write):
  mmcblk0: ios=5043/2888, merge=0/5, ticks=68992/3317988, in_queue=3386981, util=96.60%